package com.danteandroid.comicpush.model;

import io.realm.RealmObject;

/**
 * Created by yons on 17/12/4.
 */

public class Comment extends RealmObject{
    public int bookId;
    public String bookTitle;
    public String title;
    public String content;
    public String author;
    public String date;

    public Comment() {
    }
//     <script>parent.disp_book_comm_item( "1", "10032778", "cuimiaofr", "10184", "進擊的巨人", "529", "0",
// "漫画终究进化，谏山创就是历史转折点成功的代言人", "2017-01-15 13:26:25", "33", "0", "进入21世纪20年代后，日本漫画也同时进入了疲软期，大量雷同的情节，相似的人物设定，风格一致的画风，让日本动漫辉煌不在，同时欧美漫画开始崛起，欧美漫画有着日本漫画无法比拟的巨大的世界观，中国漫画也在孜孜泥土中孕育着。进击的巨人这个奇葩的名字带来了新鲜的气息，同样深邃的世界里，有着日本漫画环环相扣的情节和从来没有过的战场，给日本漫画带来一股新鲜的气息，也让日本漫画潮流进入了国际大时代", "1", "0" );</script>
//     <script>parent.disp_book_comm_item( "2", "10020010", "14763003", "10184", "進擊的巨人", "1607", "4",
// "一个真实的人性世界", "2017-02-14 14:28:47", "11", "0", "我喜欢进击的一个很重要的原因就是喜欢它的残酷。残酷的生存竞争，令人享受在现实生活中没有的极端体验以外，还有就是它对这种极端境况之下对人的刻画。经常会看到一些人对某个动漫作品的评论是“这部作品里所有人物都很喜欢”或者“这里面的反派都没有一个是令人讨厌的。”在我看来，这并不是一种对作品的赞扬，而是一种批评。作品里面，反派或者小人物，是应该（至少有一些）令人讨厌的。就像人性里的很多特质（比如说某一种欲望）本身没有好坏之分，或者说是好坏参半一样，很多时候只是程度的深浅来决定一个人的好坏。而伟大的反角往往只是因为一路走到黑而成为“恶”的代表而已，就是说，是“极端”的错，不是本身观点或美学的错。", "1", "0" );</script>
//     <script>parent.disp_book_comm_item( "3", "10017416", "天水麒麟儿", "10184", "進擊的巨人", "1533", "5",
// "自由之翼永远飘扬", "2017-02-12 11:15:12", "6", "0", "近几年中，这样的漫画出现了很多比较血腥但是看起来觉得很有深度的漫画，进击的巨人就是其中之一，谏山创先生的价值观在本作中得到了很好的展现，这个世界是残酷的，强弱是永不对等的，但是要有着对自由的理想和信念，想去看看大海的样子，在被囚禁的环境中也要有着对自由和理想的向往和追求，不然与家畜何异、剥去残酷与血腥，呈现在人们面前的是近似于《肖申克的救赎》的情怀，信念让人自由，希望让人自由，自由之翼永远飘扬。", "1", "0" );</script>
//     <script>parent.disp_book_comm_item( "4", "10032003", "4065*****", "10184", "進擊的巨人", "495", "0",
// "很棒的漫画", "2017-01-14 19:56:29", "5", "0", "这部漫画给我强烈的冲击，作者画风清奇，主要在于剧情太精彩，各种伏笔。超喜欢！之前是看动画，然后再看的漫画，一开始这个画风跟动画差距不小，久了就接受这个设定了，主要还是剧情！推荐！", "1", "0" );</script>
//     <script>parent.disp_book_comm_item( "5", "10029111", "dd_yonglaizhuce", "10184", "進擊的巨人", "249", "0", "进击的巨人", "2017-01-06 13:02:03", "5", "0",
// "作者一开始就考虑好整个故事的走向，所以伏笔悬念都非常精彩，不像一些边画边想情节的漫画。作者立意非常高，但看到后面觉得政治隐喻味挺浓的，网上也有传言作者是极右，不知真假", "1", "0" );</script>
//     <script>parent.disp_book_comm_item( "6", "10001381", "for163register", "10184", "進擊的巨人", "43", "0", "瑕不掩疵的作品", "2016-12-30 15:14:41", "5", "0",
// "完成度超高的作品。即使谏山创的画功让人不敢恭维，但精彩的剧情和设定足以让整部作品达到五星。连看基本漫画后晚上真会做恶梦，绝望的氛围塑造得太好了。", "1", "0" );</script>
}
